/*********************************************************************
*               SEGGER MICROCONTROLLER SYSTEME GmbH                  *
*       Solutions for real time microcontroller applications         *
**********************************************************************
*                                                                    *
*       (C) 2003 - 2007   SEGGER Microcontroller Systeme GmbH        *
*                                                                    *
*       www.segger.com     Support: support@segger.com               *
*                                                                    *
**********************************************************************
*                                                                    *
*       TCP/IP stack for embedded applications                       *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
File    : IP_DHCPc.c
Purpose : DHCP client implementation
--------  END-OF-HEADER  ---------------------------------------------

RFC 1533: DHCP Options and BOOTP Vendor Extensions
RFC 2131: Dynamic Host Configuration Protocol         March 1997

 --------                               -------
|        | +-------------------------->|       |<-------------------+
| INIT-  | |     +-------------------->| INIT  |                    |

#define  DHCP_OPTION_DNSRV            6    // IP address of domain name server
#define  DHCP_OPTION_NAME            12    // Name
#define  DHCP_OPTION_DOMAIN          15    // Domain name
#define  DHCP_OPTION_CADDR           50    // Client requested IP address
#define  DHCP_OPTION_LEASE           51    // Lease time
#define  DHCP_OPTION_TYPE            53    // DHCP type of DHCP packet, see DHCP packet types
#define  DHCP_OPTION_SERVER          54    // Server ID (IP address)
#define  DHCP_OPTION_REQLIST         55    // Client's parameter request list: RFC 1533, 9.6. Parameter Request List
#define  DHCP_OPTION_RENEWAL         58    // Renewal time (T1)
#define  DHCP_OPTION_REBINDING       59    // Rebinding time (T2)
#define  DHCP_OPTION_CLIENT          61    // Client ID (i.e. hardware address)
#define  DHCP_OPTION_END            255    // Marks end of valid options

//
// Network masks
//
#define  AMASK    0x80000000
#define  AADDR    0x00000000
#define  BMASK    0xC0000000
#define  BADDR    0x80000000
#define  CMASK    0xE0000000
#define  CADDR    0xC0000000

//
// DHCP client states
//
#define  DHCPC_STATE_UNUSED       0  /* no discovery attempted */
#define  DHCPC_STATE_INIT         1  /* Ready to send a DISCOVER packet */
#define  DHCPC_STATE_INITREBOOT   2  /* Have IP, ready to send REQUEST(skip DISCOVER)*/
#define  DHCPC_STATE_REBOOTING    3  /* rebooting/reclaiming address */
#define  DHCPC_STATE_SELECTING    4  /* discovery sent, but no offer yet */
#define  DHCPC_STATE_REQUESTING   5  /* sent request; waiting for ACK|NAK */
#define  DHCPC_STATE_BOUND        6  /* got a ACK we liked */
#define  DHCPC_STATE_RENEWING     7  /* Renewing the lease */
#define  DHCPC_STATE_REBINDING    8  /* rebinding to new server */
#define  DHCPC_STATE_RESTARTING   9  /* Temp. state. Only to inform callback() */
#define  DHCPC_STATE_CHECK_IP    10  // Not part of the diagram: This state is entered before "BOUND", when waiting for answer to ARP-packet to make sure IP-addr is not in use
#define  DHCPC_STATE_WAIT_INIT   11  // Not part of the diagram: This state is entered if CHECK_IP fails. RFC2131, 3.1.5 says: The client SHOULD wait a minimum of ten seconds before restarting the configuration process to avoid excessive network traffic in case of looping.

//
// Packet op codes
//
#define  BOOTP_REQUEST            1
#define  BOOTP_REPLY              2

//
// RFC1048 options for the 'BOOTP Vendor Information' field
//
#define  RFC1084_MAGIC_COOKIE htonl(0x63825363)
#define  RFC1084_PAD          ((U8) 0)
#define  RFC1084_SUBNET_MASK  ((U8) 1)
#define  RFC1084_GATEWAY      ((U8) 3)
#define  RFC1084_END          ((U8) 255)

#define  BOOTP_OPTSIZE      64   // Older value
#define  DHCP_OPTSIZE      312   // Newer value

/*********************************************************************
*
*       Local data types
*
**********************************************************************
*/

//
// The structure of a BOOTP/DHCP packet. This is the
// UDP data area of a BOOTP or DHCP packet.
//
typedef struct bootp {
//
//    Field                   | Offset | Description (RFC951, section 3. Packet Format)
// -------------------------------------------------------------------------------------------------------------------------
  U8  op;                     //  0x00 - Packet op code / message type. 1 = BOOTREQUEST, 2 = BOOTREPLY
  U8  htype;                  //       - Hardware address type, see ARP section in "Assigned Numbers" RFC. '1' = 10mb ethernet
  U8  hlen;                   //       - Hardware address length (eg '6' for 10mb ethernet).
  U8  hops;                   //       - Client sets to zero, optionally used by gateways in cross-gateway booting.
  U32 xid;                    //  0x04 - Transaction ID, a random number, used to match this boot request with the responses it generates.
  U16 secs;                   //  0x08 - Filled in by client, seconds elapsed since client started trying to boot.
  U16 flags;                  //  0x0A - Unused
  U32 ciaddr;                 //  0x0C - Client IP address; filled in by client in bootrequest if known.
  U32 yiaddr;                 //  0x10 - 'your' (client) IP address; filled by server if client doesn't know its own address (ciaddr was 0).
  U32 siaddr;                 //  0x14 - Server IP address; returned in bootreply by server.
  U32 giaddr;                 //  0x18 - Gateway IP address, used in optional cross-gateway booting.
  U8  chaddr[16];             //  0x1C - Client hardware address, filled in by client.
  U8  sname[64];              //  0x2C - Optional server host name, null terminated string.
  U8  file[128];              //  0x6C - Boot file name, null terminated string; 'generic' name or null in bootrequest, fully qualified directory-path name in bootreply.
  U8  options[BOOTP_OPTSIZE]; //  0xEC - Optional vendor-specific area, e.g. could be hardware type/serial on request, or 'capability' / remote file system handle on reply. This info may be set aside for use by a third phase bootstrap or kernel.
} BOOTP;

/* DHCP client per-interface state: */
typedef struct DHC_STATE {
  unsigned state;
  int      tries;         /* retry count of current state */
  U32      xid;           /* last xid sent */
  U16      secs;          /* seconds since client came up */
  U32      last_tick;     /* time of last DHCP packet */
  U32      lease;         /* lease; only valid if state == DHCPC_STATE_BOUND */
  U32      t1 ;           /* lease related - renew timer */
  U32      t2 ;           /* lease related - rebind timer */
  U32      lease_start;   /* time  in cticks   of when  lease started */
  /* Configuration  options  of outstanding request */
  ip_addr  IpAddr;        /* IP address */
  ip_addr  snmask;        /* subnet mask */
